app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hi"], ["user_id", 5], ["created_at", "2016-02-27 16:02:02.214488"], ["updated_at", "2016-02-27 16:02:02.214488"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # Assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)